Revit 2027 API
Water.WaterBumpAmount Property
 The property labeled "Wave Height" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaterBumpAmount { get; }
Public Shared ReadOnly Property WaterBumpAmount As String
	Get
public:
static property String^ WaterBumpAmount {
	String^ get ();
}
static member WaterBumpAmount : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 5".
See Also
Reference
Water Class
Autodesk.Revit.DB.Visual Namespace